InformationRegisters/ВычетыПоДоходамНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВычетыПоДоходамНДФЛ</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГодовойВычет</Name>
					<Comment>Сумма вычета по коду дохода за год</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативЗатрат</Name>
					<Comment>Норматив затрат в процентах от суммы дохода по авторским вознаграждениям, размер вычета по каждому случаю выплаты иных доходов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВычетыПоДоходамНДФЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в набор записей регистра "ВычетыПоДоходамНДФЛ".
//
// Параметры:
//		НаборЗаписей - РегистрыСведений.ВычетыПоДоходамНДФЛ.НаборЗаписей
//		ДатаСведений - Дата.
//		КодДохода - СправочникСсылка.ВидыДоходовНДФЛ.
//		ГодовойВычет - Число.
//		НормативЗатрат - Число. 
// 
Процедура ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, КодДохода, ГодовойВычет, НормативЗатрат) Экспорт

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Период         = ДатаСведений;
	НоваяЗапись.КодДохода      = КодДохода;
	НоваяЗапись.ГодовойВычет   = ГодовойВычет;
	НоваяЗапись.НормативЗатрат = НормативЗатрат;

КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВычетыПоДоходамНДФЛ();
	
КонецПроцедуры

// Выполняет заполнение справочника "ВидыДоходовНДФЛ".
//
Процедура ЗаполнитьВычетыПоДоходамНДФЛ()
	
	ВидыДоходовНДФЛ = Справочники.ВидыДоходовНДФЛ;
	
	// РАЗМЕРЫ СКИДОК К ДОХОДАМ
	
	НаборЗаписей = РегистрыСведений.ВычетыПоДоходамНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	ДатаСведений = '20100101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код1211, 12000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2201, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2202, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2203, 0,	 40);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2204, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2205, 0,	 40);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2206, 0,	 25);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2207, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2208, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2209, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2720, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2730, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2740, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2760, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2761, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2762, 0, 50000);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2770, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2790, 10000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2791, 0, 4300);
	
	ДатаСведений = '20200101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2763, 4000, 0);
	
	ДатаСведений = '20210101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2720c2021, 4000, 0);
	
	ДатаСведений = '20260101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2762, 0, 1000000);
	
	// Запишем набор записей в режиме добавления.
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
